{
  "apple": "Apel mengandung 52 kalori per 100 gram. Kaya akan serat larut (2,4g/100g), vitamin C (4,6mg/100g), dan kalium (107mg/100g). Mengandung antioksidan quercetin dan catechin yang membantu melawan radikal bebas. Indeks glikemik rendah (36) sehingga baik untuk penderita diabetes. Kandungan pektin membantu menurunkan kolesterol jahat (LDL).",
  "banana": "Pisang mengandung 89 kalori per 100 gram. Sangat tinggi kalium (358mg/100g), vitamin B6 (0,4mg/100g), dan vitamin C (8,7mg/100g). Kaya karbohidrat alami (22,8g/100g) yang memberikan energi cepat. Mengandung triptofan yang membantu produksi serotonin. Serat 2,6g/100g mendukung kesehatan pencernaan.",
  "beetroot": "Bit mengandung 43 kalori per 100 gram. Kaya folat (109mcg/100g), mangan (0,33mg/100g), dan nitrat alami yang membantu vasodilatasi. Mengandung betalain, antioksidan unik yang memberikan warna merah. Vitamin C 4,9mg/100g dan serat 2,8g/100g. Nitrat dalam bit dapat meningkatkan performa olahraga.",
  "bell_pepper": "Paprika mengandung 31 kalori per 100 gram. Sangat tinggi vitamin C (190mg/100g), hampir 3 kali lipat kebutuhan harian. Kaya vitamin A (3131 IU/100g) dan beta-karoten. Mengandung capsanthin dan quercetin sebagai antioksidan. Serat 2,5g/100g dan kalium 211mg/100g. Rendah sodium sehingga baik untuk tekanan darah.",
  "cabbage": "Kubis mengandung 25 kalori per 100 gram. Tinggi vitamin C (36,6mg/100g) dan vitamin K (76mcg/100g). Mengandung sulforaphane dan indole-3-carbinol yang bersifat antikanker. Serat 2,5g/100g dan folat 43mcg/100g. Kaya antioksidan anthocyanin terutama pada kubis ungu.",
  "capsicum": "Capsicum mengandung 31 kalori per 100 gram. Vitamin C sangat tinggi (190mg/100g), vitamin A (3131 IU/100g), dan vitamin E (1,6mg/100g). Mengandung capsaicin dalam jumlah kecil yang dapat meningkatkan metabolisme. Kaya antioksidan lutein dan zeaxanthin untuk kesehatan mata. Folat 46mcg/100g.",
  "carrot": "Wortel mengandung 41 kalori per 100 gram. Sangat tinggi beta-karoten (8285mcg/100g) yang dikonversi menjadi vitamin A. Vitamin K1 (13,2mcg/100g) dan kalium (320mg/100g). Mengandung alpha-karoten dan lutein. Serat 2,8g/100g dan gula alami 4,7g/100g. Lebih baik diserap jika dimasak dengan sedikit minyak.",
  "cauliflower": "Kembang kol mengandung 25 kalori per 100 gram. Tinggi vitamin C (48,2mg/100g) dan vitamin K (15,5mcg/100g). Kaya choline (44,3mg/100g) yang penting untuk fungsi otak. Mengandung sulforaphane dan indole-3-carbinol. Serat 2g/100g dan folat 57mcg/100g. Rendah karbohidrat (5g/100g).",
  "chilli_pepper": "Cabai mengandung 40 kalori per 100 gram. Sangat tinggi vitamin C (144mg/100g), vitamin A (952 IU/100g), dan capsaicin. Capsaicin dapat meningkatkan metabolisme hingga 8% dan memiliki efek analgesik. Vitamin B6 (0,51mg/100g) dan kalium (322mg/100g). Mengandung antioksidan capsanthin dan capsorubin.",
  "corn": "Jagung mengandung 86 kalori per 100 gram. Kaya karbohidrat kompleks (19g/100g) dan serat 2,7g/100g. Tinggi vitamin B1/thiamin (0,2mg/100g) dan magnesium (37mg/100g). Mengandung antioksidan lutein dan zeaxanthin untuk kesehatan mata. Folat 42mcg/100g dan fosfor 89mg/100g.",
  "cucumber": "Mentimun mengandung 16 kalori per 100 gram. Sangat tinggi kandungan air (95%). Vitamin K (16,4mcg/100g) dan kalium (147mg/100g). Mengandung cucurbitacin yang memiliki sifat anti-inflamasi. Silika alami yang baik untuk kesehatan kulit dan rambut. Serat 0,5g/100g dan vitamin C 2,8mg/100g.",
  "eggplant": "Terong mengandung 25 kalori per 100 gram. Tinggi serat (3g/100g) dan rendah karbohidrat. Mengandung nasunin, antioksidan anthocyanin yang melindungi sel saraf. Vitamin B1 (0,039mg/100g) dan kalium (229mg/100g). Chlorogenic acid yang membantu menurunkan kolesterol. Folat 22mcg/100g.",
  "garlic": "Bawang putih mengandung 149 kalori per 100 gram. Kaya allicin, senyawa sulfur dengan sifat antimikroba. Vitamin C (31,2mg/100g) dan vitamin B6 (1,2mg/100g). Mangan (1,67mg/100g) dan selenium (14,2mcg/100g). Mengandung S-allyl cysteine yang cardioprotective. Hanya dikonsumsi dalam jumlah kecil.",
  "ginger": "Jahe mengandung 80 kalori per 100 gram. Kaya gingerol dan shogaol, senyawa bioaktif anti-inflamasi. Vitamin C (5mg/100g) dan magnesium (43mg/100g). Mengandung zingeron yang memberikan rasa pedas. Kalium 415mg/100g dan fosfor 34mg/100g. Membantu penyerapan nutrisi lain.",
  "grapes": "Anggur mengandung 62 kalori per 100 gram. Kaya resveratrol, antioksidan yang melindungi jantung. Vitamin C (10,8mg/100g) dan vitamin K (22mcg/100g). Mengandung anthocyanin dan flavonoid. Kalium 191mg/100g dan mangan 0,071mg/100g. Gula alami 15,5g/100g memberikan energi cepat.",
  "jalepeno": "Jalapeno mengandung 29 kalori per 100 gram. Tinggi vitamin C (118,6mg/100g) dan vitamin A (1078 IU/100g). Capsaicin memberikan rasa pedas dan efek thermogenic. Vitamin B6 (0,42mg/100g) dan folat 27mcg/100g. Kalium 248mg/100g dan serat 2,8g/100g.",
  "kiwi": "Kiwi mengandung 61 kalori per 100 gram. Sangat tinggi vitamin C (92,7mg/100g), lebih tinggi dari jeruk. Vitamin K (40,3mcg/100g) dan folat 25mcg/100g. Kaya serat larut dan tidak larut (3g/100g). Mengandung enzim actinidin yang membantu pencernaan protein. Kalium 312mg/100g.",
  "lemon": "Lemon mengandung 29 kalori per 100 gram. Sangat tinggi vitamin C (53mg/100g) dan citric acid. Mengandung limonene dalam kulitnya yang bersifat antioksidan. Folat 6mcg/100g dan kalium 138mg/100g. Flavonoid hesperidin dan diosmin yang anti-inflamasi. Rendah gula (1,5g/100g).",
  "lettuce": "Selada mengandung 15 kalori per 100 gram. Tinggi vitamin K (126mcg/100g) dan vitamin A (740 IU/100g). Folat 38mcg/100g dan vitamin C 9,2mg/100g. Mengandung lactucarium yang memiliki efek menenangkan ringan. Serat 1,3g/100g dan kalium 194mg/100g. Kandungan air 95%.",
  "mango": "Mangga mengandung 60 kalori per 100 gram. Sangat tinggi vitamin A (1082 IU/100g) dan vitamin C (36,4mg/100g). Kaya beta-karoten dan zeaxanthin. Serat 1,6g/100g dan folat 43mcg/100g. Mengandung enzim amilase yang membantu pencernaan karbohidrat. Kalium 168mg/100g.",
  "onion": "Bawang bombai mengandung 40 kalori per 100 gram. Kaya quercetin, antioksidan flavonoid yang kuat. Vitamin C (7,4mg/100g) dan folat 19mcg/100g. Mengandung senyawa sulfur yang memberikan aroma khas. Chromium yang membantu metabolisme glukosa. Serat 1,7g/100g dan kalium 146mg/100g.",
  "orange": "Jeruk mengandung 47 kalori per 100 gram. Sangat tinggi vitamin C (53,2mg/100g) dan folat 40mcg/100g. Kaya flavonoid hesperidin yang mendukung kesehatan jantung. Serat pektin (2,4g/100g) membantu menurunkan kolesterol. Kalium 181mg/100g dan kalsium 40mg/100g.",
  "paprika": "Paprika mengandung 31 kalori per 100 gram. Sangat tinggi vitamin C (190mg/100g), vitamin A (3131 IU/100g), dan vitamin E (1,6mg/100g). Mengandung capsanthin dan capsorubin sebagai antioksidan. Folat 46mcg/100g dan kalium 211mg/100g. Rendah sodium dan kaya antioksidan karotenoid.",
  "pear": "Pir mengandung 57 kalori per 100 gram. Tinggi serat (3,1g/100g) terutama pektin yang larut. Vitamin C (4,3mg/100g) dan vitamin K (4,5mcg/100g). Mengandung arbutin yang bersifat antimikroba. Kalium 116mg/100g dan tembaga 0,082mg/100g. Sorbitol alami yang dapat memiliki efek laksatif ringan.",
  "peas": "Kacang polong mengandung 81 kalori per 100 gram. Tinggi protein nabati (5,4g/100g) dan serat (5,7g/100g). Vitamin K (24,8mcg/100g) dan folat 65mcg/100g. Kaya vitamin C (40mg/100g) dan vitamin A (765 IU/100g). Mengandung saponin yang memiliki sifat anti-inflamasi. Kalium 244mg/100g.",
  "pineapple": "Nanas mengandung 50 kalori per 100 gram. Mengandung bromelain, enzim proteolitik yang membantu pencernaan protein. Vitamin C (47,8mg/100g) dan mangan (0,93mg/100g). Serat 1,4g/100g dan folat 18mcg/100g. Gula alami 9,9g/100g dan kalium 109mg/100g.",
  "pomegranate": "Delima mengandung 83 kalori per 100 gram. Sangat tinggi antioksidan, terutama punicalagin dan anthocyanin. Vitamin C (10,2mg/100g) dan vitamin K (16,4mcg/100g). Folat 38mcg/100g dan kalium 236mg/100g. Serat 4g/100g dan tanin yang memberikan rasa sepat. Ellagic acid yang bersifat antikarsinogenik.",
  "potato": "Kentang mengandung 77 kalori per 100 gram. Kaya karbohidrat kompleks (17,5g/100g) dan kalium (425mg/100g). Vitamin C (19,7mg/100g) dan vitamin B6 (0,3mg/100g). Mengandung resistant starch yang baik untuk kesehatan usus. Serat 2,1g/100g dan folat 15mcg/100g.",
  "raddish": "Lobak mengandung 16 kalori per 100 gram. Tinggi vitamin C (14,8mg/100g) dan folat 25mcg/100g. Mengandung isothiocyanate yang bersifat antimikroba. Kalium 233mg/100g dan serat 1,6g/100g. Raphanoside yang memberikan rasa pedas khas. Kaya air (95%) dan rendah sodium.",
  "soy_beans": "Kedelai mengandung 173 kalori per 100 gram. Protein lengkap (18,2g/100g) dengan semua asam amino esensial. Kaya isoflavon genistein dan daidzein. Folat 200mcg/100g dan kalium 515mg/100g. Serat 6g/100g dan zat besi 2,5mg/100g. Lesitin yang baik untuk otak.",
  "spinach": "Bayam mengandung 23 kalori per 100 gram. Sangat tinggi vitamin K (483mcg/100g), vitamin A (9377 IU/100g), dan folat (194mcg/100g). Kaya zat besi (2,7mg/100g) dan magnesium (79mg/100g). Mengandung lutein dan zeaxanthin untuk kesehatan mata. Nitrat alami yang mendukung fungsi kardiovaskular.",
  "sweetcorn": "Jagung manis mengandung 96 kalori per 100 gram. Kaya karbohidrat (21g/100g) dan serat 2,4g/100g. Tinggi vitamin B1/thiamin (0,2mg/100g) dan magnesium (37mg/100g). Mengandung zeaxanthin dan lutein yang tinggi. Folat 46mcg/100g dan kalium 270mg/100g.",
  "sweetpotato": "Ubi jalar mengandung 86 kalori per 100 gram. Sangat tinggi beta-karoten (8509mcg/100g) yang dikonversi menjadi vitamin A. Vitamin C (2,4mg/100g) dan kalium (337mg/100g). Serat 3g/100g dan karbohidrat kompleks 20,1g/100g. Mengandung anthocyanin pada varietas ungu.",
  "tomato": "Tomat mengandung 18 kalori per 100 gram. Sangat tinggi likopen (2573mcg/100g), antioksidan karotenoid yang kuat. Vitamin C (13,7mg/100g) dan vitamin K (7,9mcg/100g). Folat 15mcg/100g dan kalium 237mg/100g. Likopen lebih bioavailable setelah dimasak. Glutamat alami yang memberikan rasa umami.",
  "turnip": "Lobak putih mengandung 28 kalori per 100 gram. Tinggi vitamin C (21mg/100g) dan folat 15mcg/100g. Mengandung glucosinolate yang bersifat antikarsinogenik. Kalium 191mg/100g dan kalsium 30mg/100g. Serat 1,8g/100g dan rendah sodium. Isothiocyanate yang memberikan rasa sedikit pedas.",
  "watermelon": "Semangka mengandung 30 kalori per 100 gram. Sangat tinggi kandungan air (92%) dan likopen (4532mcg/100g). Vitamin C (8,1mg/100g) dan vitamin A (569 IU/100g). Citrulline yang dapat meningkatkan aliran darah. Kalium 112mg/100g dan magnesium 10mg/100g. Sangat rendah sodium dan lemak.",
  "not_fruit_or_vegetable": "Gambar yang Anda masukkan bukan buah atau sayuran yang dikenali oleh sistem. Untuk mendapatkan informasi nutrisi yang akurat, silakan coba lagi dengan gambar buah atau sayuran yang jelas dan berkualitas baik."
}