{
  "apple": "Apel adalah buah yang sangat populer di seluruh dunia. Apel kaya akan serat, vitamin C, dan berbagai antioksidan. Mengonsumsi apel secara rutin dapat membantu menurunkan risiko penyakit jantung, diabetes, dan kanker tertentu. Apel juga baik untuk kesehatan pencernaan karena kandungan seratnya yang tinggi. Selain itu, apel rendah kalori sehingga cocok untuk diet sehat. Apel dapat dikonsumsi langsung, dijadikan jus, salad, atau campuran makanan lainnya.",
  "banana": "Pisang adalah buah tropis yang kaya akan kalium, vitamin B6, vitamin C, dan serat. Pisang sangat baik untuk menjaga kesehatan jantung, membantu mengatur tekanan darah, serta memberikan energi instan karena kandungan karbohidratnya. Pisang juga mengandung prebiotik yang baik untuk kesehatan usus. Selain itu, pisang mudah dicerna dan sering direkomendasikan untuk pemulihan setelah sakit.",
  "beetroot": "Bit adalah umbi berwarna merah keunguan yang kaya akan folat, zat besi, kalium, dan antioksidan. Bit membantu meningkatkan kesehatan darah, mendukung fungsi hati, serta menurunkan tekanan darah. Bit juga memiliki sifat antiinflamasi dan baik untuk daya tahan tubuh. Bit sering dikonsumsi sebagai jus, salad, atau direbus.",
  "bell pepper": "Paprika adalah sayuran berwarna cerah yang kaya vitamin C, vitamin A, dan antioksidan seperti beta-karoten. Paprika membantu meningkatkan sistem kekebalan tubuh, menjaga kesehatan kulit, serta mendukung kesehatan mata. Paprika juga rendah kalori sehingga cocok untuk diet sehat. Bisa dimakan mentah, ditumis, atau dipanggang.",
  "cabbage": "Kubis adalah sayuran berdaun yang mengandung vitamin C, vitamin K, serat, dan antioksidan. Kubis membantu menjaga kesehatan pencernaan, meningkatkan sistem imun, dan menurunkan risiko penyakit jantung. Kubis dapat dimakan mentah dalam salad, atau dimasak sebagai sup dan tumisan.",
  "capsicum": "Capsicum adalah istilah lain untuk cabai paprika, mengandung vitamin C, vitamin A, dan berbagai fitokimia. Capsicum mendukung sistem kekebalan tubuh, kesehatan kulit, dan membantu melawan radikal bebas. Selain itu, rasanya manis dan renyah sehingga cocok dijadikan campuran masakan.",
  "carrot": "Wortel adalah sayuran akar yang terkenal dengan kandungan beta-karoten yang tinggi, yang diubah tubuh menjadi vitamin A. Vitamin A sangat penting untuk kesehatan mata, sistem imun, dan kulit. Wortel juga mengandung serat, vitamin K1, kalium, dan antioksidan lain yang membantu menurunkan risiko penyakit kronis. Wortel dapat dikonsumsi mentah, direbus, dikukus, atau dijadikan jus.",
  "cauliflower": "Kembang kol adalah sayuran yang kaya vitamin C, vitamin K, serat, dan antioksidan. Kembang kol mendukung kesehatan pencernaan, membantu menurunkan risiko kanker, dan menjaga sistem imun. Kembang kol bisa dikukus, direbus, atau diolah menjadi sup dan berbagai hidangan sehat.",
  "chilli pepper": "Cabai adalah buah pedas yang kaya vitamin C, beta-karoten, dan capsaicin. Capsaicin dapat membantu meningkatkan metabolisme, mengurangi rasa sakit, dan bersifat antiinflamasi. Cabai juga mendukung kesehatan jantung jika dikonsumsi dalam jumlah wajar. Cabai biasa digunakan sebagai bumbu masakan.",
  "corn": "Jagung adalah sumber karbohidrat kompleks yang juga kaya serat, vitamin B, magnesium, dan antioksidan lutein. Jagung baik untuk kesehatan mata, mendukung pencernaan, serta memberikan energi. Jagung bisa direbus, dibakar, atau dijadikan campuran sup dan salad.",
  "cucumber": "Mentimun adalah sayuran berair yang rendah kalori dan tinggi vitamin K, serta antioksidan. Mentimun membantu menjaga hidrasi tubuh, baik untuk kesehatan kulit, dan mendukung kesehatan pencernaan. Mentimun sering dimakan segar sebagai lalapan atau campuran salad.",
  "eggplant": "Terong adalah sayuran yang kaya serat, vitamin B1, vitamin B6, dan antioksidan seperti nasunin. Terong membantu menjaga kesehatan jantung, mendukung fungsi otak, dan menurunkan kadar kolesterol. Terong bisa dimasak dengan berbagai cara seperti dipanggang, ditumis, atau dibuat balado.",
  "garlic": "Bawang putih adalah bumbu dapur yang terkenal dengan senyawa allicin yang bersifat antibakteri dan antioksidan. Bawang putih dapat membantu meningkatkan kekebalan tubuh, menurunkan tekanan darah, dan menjaga kesehatan jantung. Bawang putih digunakan luas dalam berbagai masakan.",
  "ginger": "Jahe adalah rempah yang memiliki sifat antiinflamasi dan antioksidan. Jahe membantu meredakan mual, meningkatkan pencernaan, serta mengurangi nyeri sendi dan otot. Jahe juga baik untuk meningkatkan sistem imun. Biasanya dikonsumsi sebagai bumbu masakan atau dibuat teh.",
  "grapes": "Anggur adalah buah yang kaya akan vitamin C, vitamin K, dan antioksidan seperti resveratrol. Anggur mendukung kesehatan jantung, menjaga sistem imun, dan membantu melawan radikal bebas. Anggur dapat dimakan langsung atau dijadikan jus.",
  "jalepeno": "Jalapeno adalah jenis cabai yang memiliki rasa pedas sedang dan kaya vitamin C, vitamin A, serta capsaicin. Jalapeno membantu meningkatkan metabolisme, mendukung kekebalan tubuh, dan bersifat antiinflamasi. Jalapeno sering digunakan dalam masakan Meksiko.",
  "kiwi": "Kiwi adalah buah berwarna hijau dengan rasa asam manis, kaya vitamin C, vitamin K, dan serat. Kiwi membantu meningkatkan sistem imun, mendukung pencernaan, serta menyehatkan kulit. Buah kiwi juga rendah kalori sehingga cocok untuk diet sehat.",
  "lemon": "Lemon adalah buah citrus yang kaya vitamin C dan antioksidan. Lemon membantu meningkatkan daya tahan tubuh, mendukung kesehatan kulit, dan menyeimbangkan kadar pH tubuh. Lemon sering digunakan sebagai penyegar minuman atau bumbu masakan.",
  "lettuce": "Selada adalah sayuran hijau berdaun yang rendah kalori, kaya vitamin K, vitamin A, dan serat. Selada baik untuk kesehatan tulang, mendukung sistem imun, serta menjaga kesehatan pencernaan. Selada biasanya digunakan dalam salad atau sebagai lalapan.",
  "mango": "Mangga adalah buah tropis manis yang kaya vitamin C, vitamin A, dan serat. Mangga membantu menjaga kesehatan mata, mendukung sistem imun, dan memperlancar pencernaan. Mangga bisa dimakan langsung atau dibuat jus dan campuran makanan penutup.",
  "onion": "Bawang bombai adalah sayuran yang kaya antioksidan, vitamin C, dan senyawa sulfur. Bawang bombai membantu meningkatkan sistem imun, menyehatkan jantung, dan bersifat antibakteri. Bawang bombai umum digunakan sebagai bumbu dasar berbagai masakan.",
  "orange": "Jeruk adalah buah citrus kaya vitamin C, serat, dan antioksidan. Jeruk membantu meningkatkan daya tahan tubuh, menyehatkan kulit, serta mendukung kesehatan jantung. Jeruk bisa dimakan langsung atau dijadikan jus segar.",
  "paprika": "Paprika adalah sayuran dengan warna cerah yang kaya vitamin C, vitamin A, dan antioksidan. Paprika membantu meningkatkan sistem kekebalan tubuh, menyehatkan kulit, dan menjaga kesehatan mata. Paprika bisa dimakan mentah, ditumis, atau dipanggang.",
  "pear": "Pir adalah buah manis yang kaya serat, vitamin C, dan antioksidan. Pir membantu menjaga kesehatan pencernaan, menurunkan risiko penyakit jantung, dan mendukung sistem imun. Pir cocok dimakan langsung atau dicampur ke salad.",
  "peas": "Kacang polong adalah sumber protein nabati, serat, vitamin K, dan folat. Kacang polong membantu menjaga kesehatan tulang, mendukung fungsi otak, dan baik untuk pencernaan. Kacang polong bisa dimasak sebagai sup atau campuran nasi goreng.",
  "pineapple": "Nanas adalah buah tropis yang kaya vitamin C, mangan, dan bromelain. Nanas membantu pencernaan protein, meningkatkan daya tahan tubuh, serta memiliki sifat antiinflamasi. Nanas cocok dimakan segar atau dibuat jus.",
  "pomegranate": "Delima adalah buah yang kaya antioksidan polifenol, vitamin C, dan serat. Delima membantu menjaga kesehatan jantung, mengurangi peradangan, serta meningkatkan kekebalan tubuh. Delima dapat dimakan langsung atau dijadikan jus.",
  "potato": "Kentang adalah sumber karbohidrat kompleks yang kaya vitamin C, vitamin B6, kalium, dan serat. Kentang membantu memberikan energi, mendukung fungsi otot dan saraf, serta baik untuk kesehatan pencernaan. Kentang bisa direbus, dipanggang, atau digoreng.",
  "raddish": "Lobak adalah sayuran akar yang rendah kalori, kaya vitamin C, kalium, dan serat. Lobak membantu mendukung kesehatan pencernaan, meningkatkan sistem imun, dan menyehatkan kulit. Lobak biasanya dikonsumsi mentah atau dimasak dalam sup.",
  "soy beans": "Kedelai adalah sumber protein nabati yang sangat baik, kaya zat besi, kalsium, dan isoflavon. Kedelai mendukung kesehatan tulang, menyeimbangkan hormon, dan menurunkan kadar kolesterol. Kedelai bisa diolah menjadi tempe, tahu, atau susu kedelai.",
  "spinach": "Bayam adalah sayuran hijau yang kaya akan zat besi, kalsium, magnesium, vitamin A, vitamin C, dan vitamin K. Bayam sangat baik untuk kesehatan tulang, darah, dan sistem imun. Konsumsi bayam secara rutin dapat membantu menurunkan tekanan darah dan menjaga kesehatan mata. Bayam bisa dimakan mentah sebagai salad, ditumis, atau dimasak dalam sup.",
  "sweetcorn": "Jagung manis adalah varietas jagung yang lebih manis dan kaya karbohidrat, serat, vitamin B, serta antioksidan lutein. Sweetcorn mendukung kesehatan mata, pencernaan, dan memberikan energi. Bisa direbus, dibakar, atau dijadikan sup.",
  "sweetpotato": "Ubi jalar adalah sumber karbohidrat kompleks yang kaya beta-karoten, vitamin C, kalium, dan serat. Ubi jalar baik untuk kesehatan mata, sistem imun, dan mendukung pencernaan. Ubi jalar dapat dikukus, direbus, atau dipanggang.",
  "tomato": "Tomat adalah buah yang sering dianggap sayuran, kaya vitamin C, vitamin A, dan likopen sebagai antioksidan kuat. Tomat membantu menjaga kesehatan jantung, kulit, dan mengurangi risiko kanker tertentu. Tomat bisa dimakan segar, dimasak, atau dibuat jus.",
  "turnip": "Lobak putih adalah sayuran akar yang mengandung vitamin C, serat, kalium, dan antioksidan. Lobak putih membantu mendukung sistem kekebalan tubuh, kesehatan pencernaan, dan menyehatkan kulit. Biasanya dimasak dalam sup atau ditumis.",
  "watermelon": "Semangka adalah buah yang sangat menyegarkan karena kandungan airnya yang tinggi, mencapai lebih dari 90%. Semangka kaya akan vitamin C, vitamin A, dan antioksidan seperti likopen yang baik untuk kesehatan jantung dan kulit. Semangka juga rendah kalori sehingga cocok untuk diet. Buah ini sangat baik dikonsumsi saat cuaca panas untuk mencegah dehidrasi.",
  "not_fruit_or_vegetable": "Gambar yang Anda masukkan bukan buah atau sayuran yang dikenali oleh sistem. Silakan coba lagi dengan gambar buah atau sayuran yang jelas."
}
